{"class_name": "Functional", "config": {"name": "loaded_model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 448], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_39"}, "name": "input_39", "inbound_nodes": []}, {"class_name": "Functional", "config": {"name": "encoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 448], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_39"}, "name": "input_39", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_102", "trainable": true, "dtype": "float32", "units": 448, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_102", "inbound_nodes": [[["input_39", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_68", "trainable": true, "dtype": "float32", "target_shape": [448, 1]}, "name": "reshape_68", "inbound_nodes": [[["dense_102", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_68", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_68", "inbound_nodes": [[["reshape_68", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_69", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_69", "inbound_nodes": [[["conv1d_68", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_68", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_68", "inbound_nodes": [[["conv1d_69", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_103", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_103", "inbound_nodes": [[["flatten_68", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "z_mean", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "z_mean", "inbound_nodes": [[["dense_103", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "z_log_var", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "z_log_var", "inbound_nodes": [[["dense_103", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "z", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABgAAAAUAAABDAAAAc0oAAAB8AFwCfQF9AnQAoAF8AaEBZAEZAH0DdACgAnwBoQFk\nAhkAfQR0AGoDfAN8BGYCZAONAX0FfAF0AKAEZAR8AhQAoQF8BRQAFwBTACkF+sxSZXBhcmFtZXRl\ncml6YXRpb24gdHJpY2sgYnkgc2FtcGxpbmcgZnJvbSBhbiBpc290cm9waWMgdW5pdCBHYXVzc2lh\nbi4KICAgICMgQXJndW1lbnRzCiAgICAgICAgYXJncyAodGVuc29yKTogbWVhbiBhbmQgbG9nIG9m\nIHZhcmlhbmNlIG9mIFEoenxYKQogICAgIyBSZXR1cm5zCiAgICAgICAgeiAodGVuc29yKTogc2Ft\ncGxlZCBsYXRlbnQgdmVjdG9yCiAgICDpAAAAAOkBAAAAKQHaBXNoYXBlZwAAAAAAAOA/KQXaAUty\nBAAAANoJaW50X3NoYXBl2g1yYW5kb21fbm9ybWFs2gNleHApBtoEYXJnc9oGel9tZWFu2gl6X2xv\nZ192YXLaBWJhdGNo2gNkaW3aB2Vwc2lsb26pAHIPAAAA+iE8aXB5dGhvbi1pbnB1dC0xMDQ0LTQ1\nMTg0ZDg1NTgzMz7aCHNhbXBsaW5nCgAAAHMKAAAAAAgIAQ4BDgIQAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [2], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "z", "inbound_nodes": [[["z_mean", 0, 0, {}], ["z_log_var", 0, 0, {}]]]}], "input_layers": [["input_39", 0, 0]], "output_layers": [["z_mean", 0, 0], ["z_log_var", 0, 0], ["z", 0, 0]]}, "name": "encoder", "inbound_nodes": [[["input_39", 0, 0, {}]]]}, {"class_name": "Functional", "config": {"name": "decoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "z_sampling"}, "name": "z_sampling", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_104", "trainable": true, "dtype": "float32", "units": 7168, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_104", "inbound_nodes": [[["z_sampling", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_69", "trainable": true, "dtype": "float32", "target_shape": [112, 64]}, "name": "reshape_69", "inbound_nodes": [[["dense_104", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_136", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukCAAAAKQHaBGF4aXMp\nAtoBS9oLZXhwYW5kX2RpbXMpAdoBeKkAcgYAAAD6ITxpcHl0aG9uLWlucHV0LTEwNDQtNDUxODRk\nODU1ODMzPtoIPGxhbWJkYT4jAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_136", "inbound_nodes": [[["reshape_69", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_68", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_68", "inbound_nodes": [[["lambda_136", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_137", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukCAAAAKQHaBGF4aXMp\nAtoBS9oHc3F1ZWV6ZSkB2gF4qQByBgAAAPohPGlweXRob24taW5wdXQtMTA0NC00NTE4NGQ4NTU4\nMzM+2gg8bGFtYmRhPiUAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_137", "inbound_nodes": [[["conv2d_transpose_68", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_138", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukCAAAAKQHaBGF4aXMp\nAtoBS9oLZXhwYW5kX2RpbXMpAdoBeKkAcgYAAAD6ITxpcHl0aG9uLWlucHV0LTEwNDQtNDUxODRk\nODU1ODMzPtoIPGxhbWJkYT4jAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_138", "inbound_nodes": [[["lambda_137", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_69", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_69", "inbound_nodes": [[["lambda_138", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_139", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukCAAAAKQHaBGF4aXMp\nAtoBS9oHc3F1ZWV6ZSkB2gF4qQByBgAAAPohPGlweXRob24taW5wdXQtMTA0NC00NTE4NGQ4NTU4\nMzM+2gg8bGFtYmRhPiUAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_139", "inbound_nodes": [[["conv2d_transpose_69", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_69", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_69", "inbound_nodes": [[["lambda_139", 0, 0, {}]]]}], "input_layers": [["z_sampling", 0, 0]], "output_layers": [["flatten_69", 0, 0]]}, "name": "decoder", "inbound_nodes": [[["encoder", 1, 2, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_102", "trainable": true, "dtype": "float32", "units": 448, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_102", "inbound_nodes": [[["input_39", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_68", "trainable": true, "dtype": "float32", "target_shape": [448, 1]}, "name": "reshape_68", "inbound_nodes": [[["dense_102", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_68", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_68", "inbound_nodes": [[["reshape_68", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_69", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_69", "inbound_nodes": [[["conv1d_68", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_68", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_68", "inbound_nodes": [[["conv1d_69", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.reshape_112", "trainable": true, "dtype": "float32", "function": "reshape"}, "name": "tf.reshape_112", "inbound_nodes": [["decoder", 1, 0, {"shape": [-1]}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.reshape_111", "trainable": true, "dtype": "float32", "function": "reshape"}, "name": "tf.reshape_111", "inbound_nodes": [["input_39", 0, 0, {"shape": [-1]}]]}, {"class_name": "Dense", "config": {"name": "dense_103", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_103", "inbound_nodes": [[["flatten_68", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.convert_to_tensor_50", "trainable": true, "dtype": "float32", "function": "convert_to_tensor"}, "name": "tf.convert_to_tensor_50", "inbound_nodes": [["tf.reshape_112", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.cast_36", "trainable": true, "dtype": "float32", "function": "cast"}, "name": "tf.cast_36", "inbound_nodes": [["tf.reshape_111", 0, 0, {"dtype": "float32"}]]}, {"class_name": "Dense", "config": {"name": "z_log_var", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "z_log_var", "inbound_nodes": [[["dense_103", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "z_mean", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "z_mean", "inbound_nodes": [[["dense_103", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.squared_difference_25", "trainable": true, "dtype": "float32", "function": "math.squared_difference"}, "name": "tf.math.squared_difference_25", "inbound_nodes": [["tf.convert_to_tensor_50", 0, 0, {"y": ["tf.cast_36", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_72", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_72", "inbound_nodes": [["_CONSTANT_VALUE", -1, 1.0, {"y": ["z_log_var", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.square_35", "trainable": true, "dtype": "float32", "function": "math.square"}, "name": "tf.math.square_35", "inbound_nodes": [["z_mean", 0, 0, {"name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_72", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_72", "inbound_nodes": [["tf.math.squared_difference_25", 0, 0, {"axis": -1, "keepdims": false}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_74", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_74", "inbound_nodes": [["tf.__operators__.add_72", 0, 0, {"y": ["tf.math.square_35", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.exp_35", "trainable": true, "dtype": "float32", "function": "math.exp"}, "name": "tf.math.exp_35", "inbound_nodes": [["z_log_var", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.clip_by_value_6", "trainable": true, "dtype": "float32", "function": "clip_by_value"}, "name": "tf.clip_by_value_6", "inbound_nodes": [["tf.math.reduce_mean_72", 0, 0, {"clip_value_min": 0.0, "clip_value_max": Infinity}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_75", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_75", "inbound_nodes": [["tf.math.subtract_74", 0, 0, {"y": ["tf.math.exp_35", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.sqrt_6", "trainable": true, "dtype": "float32", "function": "math.sqrt"}, "name": "tf.math.sqrt_6", "inbound_nodes": [["tf.clip_by_value_6", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum_39", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum_39", "inbound_nodes": [["tf.math.subtract_75", 0, 0, {"axis": -1, "keepdims": false}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_84", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_84", "inbound_nodes": [["tf.math.sqrt_6", 0, 0, {"y": 448, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_85", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_85", "inbound_nodes": [["tf.math.reduce_sum_39", 0, 0, {"y": -0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_73", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_73", "inbound_nodes": [["tf.math.multiply_84", 0, 0, {"y": ["tf.math.multiply_85", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_73", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_73", "inbound_nodes": [["tf.__operators__.add_73", 0, 0, {"axis": null, "keepdims": false}]]}, {"class_name": "AddLoss", "config": {"name": "add_loss_32", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss_32", "inbound_nodes": [[["tf.math.reduce_mean_73", 0, 0, {}]]]}], "input_layers": [["input_39", 0, 0]], "output_layers": [["decoder", 1, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}