{"class_name": "Model", "config": {"name": "model_122", "layers": [{"name": "input_61", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 448], "dtype": "float32", "sparse": false, "name": "input_61"}, "inbound_nodes": []}, {"name": "dense_91", "class_name": "Dense", "config": {"name": "dense_91", "trainable": true, "dtype": "float32", "units": 100, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_61", 0, 0, {}]]]}, {"name": "dense_92", "class_name": "Dense", "config": {"name": "dense_92", "trainable": true, "dtype": "float32", "units": 448, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_91", 0, 0, {}]]]}], "input_layers": [["input_61", 0, 0]], "output_layers": [["dense_92", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}