{"class_name": "Model", "config": {"name": "model_22", "layers": [{"name": "input_11", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 448], "dtype": "float32", "sparse": false, "name": "input_11"}, "inbound_nodes": []}, {"name": "dense_16", "class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 0.0}}, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"name": "dense_17", "class_name": "Dense", "config": {"name": "dense_17", "trainable": true, "dtype": "float32", "units": 448, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_16", 0, 0, {}]]]}], "input_layers": [["input_11", 0, 0]], "output_layers": [["dense_17", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}