{"class_name": "Model", "config": {"name": "model_118", "layers": [{"name": "input_59", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 448], "dtype": "float32", "sparse": false, "name": "input_59"}, "inbound_nodes": []}, {"name": "dense_88", "class_name": "Dense", "config": {"name": "dense_88", "trainable": true, "dtype": "float32", "units": 50, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_59", 0, 0, {}]]]}, {"name": "dense_89", "class_name": "Dense", "config": {"name": "dense_89", "trainable": true, "dtype": "float32", "units": 448, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_88", 0, 0, {}]]]}], "input_layers": [["input_59", 0, 0]], "output_layers": [["dense_89", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}